In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({
    "first_name": ["John","jane","emily","Matt","Alex"],
    "last_name": ["Doe","doe","uth","Dan","mir"],
    "group": ["A-1B","B-1B","A-1C","A-1B","C-1C"],
    "salary": ["$75000","$72000","£45000","$77000","£58,000"]
})
df

  first_name last_name group   salary
0       John       Doe  A-1B   $75000
1       jane       doe  B-1B   $72000
2      emily       uth  A-1C   £45000
3       Matt       Dan  A-1B   $77000
4       Alex       mir  C-1C  £58,000

### Split
A string might include multiple pieces of information. For instance, a typical address shows street, city, and state information. In our mock DataFrame, the group column consists of two parts combined with a hyphen. If we want to represent groups in two separate columns, we can split it.

In [6]:
fun1=lambda x:x.split('-')[0]
fun2=lambda x:x.split('-')[1]

In [7]:
df['Group1']=df['group'].apply(fun1)
df['Group2']=df['group'].apply(fun2)

In [8]:
df

  first_name last_name group   salary Group1 Group2
0       John       Doe  A-1B   $75000      A     1B
1       jane       doe  B-1B   $72000      B     1B
2      emily       uth  A-1C   £45000      A     1C
3       Matt       Dan  A-1B   $77000      A     1B
4       Alex       mir  C-1C  £58,000      C     1C

## OR

In [16]:
df["group"].str.split("-")

0    [A, 1B]
1    [B, 1B]
2    [A, 1C]
3    [A, 1B]
4    [C, 1C]
Name: group, dtype: object

### The output values are lists that contain each item created after splitting. We can create separate columns by using the expand parameter.

In [22]:
df["group"].str.split("-", expand=True)
# The output is a DataFrame

   0   1
0  A  1B
1  B  1B
2  A  1C
3  A  1B
4  C  1C

In [4]:
df["group1"] = df["group"].str.split("-", expand=True)[0]
df["group2"] = df["group"].str.split("-", expand=True)[1]
df

  first_name last_name group   salary group1 group2
0       John       Doe  A-1B   $75000      A     1B
1       jane       doe  B-1B   $72000      B     1B
2      emily       uth  A-1C   £45000      A     1C
3       Matt       Dan  A-1B   $77000      A     1B
4       Alex       mir  C-1C  £58,000      C     1C

In [6]:
# method 1
df["first_name"].str.cat(df["last_name"], sep=" ")
# method 2
df["first_name"] + " " + df["last_name"]

0     John Doe
1     jane doe
2    emily uth
3     Matt Dan
4     Alex mir
dtype: object

In [7]:
df['FullName']=df["first_name"] + " " + df["last_name"]

In [8]:
df

  first_name last_name group   salary group1 group2   FullName
0       John       Doe  A-1B   $75000      A     1B   John Doe
1       jane       doe  B-1B   $72000      B     1B   jane doe
2      emily       uth  A-1C   £45000      A     1C  emily uth
3       Matt       Dan  A-1B   $77000      A     1B   Matt Dan
4       Alex       mir  C-1C  £58,000      C     1C   Alex mir

In [9]:
df["first_name"].str.lower() + " " + df["last_name"].str.lower()

0     john doe
1     jane doe
2    emily uth
3     matt dan
4     alex mir
dtype: object

In [10]:
df["first_name"].str.capitalize() + " " + df["last_name"].str.capitalize()

0     John Doe
1     Jane Doe
2    Emily Uth
3     Matt Dan
4     Alex Mir
dtype: object

In [2]:
product=('Laptop', 10, 699)
product

('Laptop', 10, 699)

In [8]:
result=','.join(str(i) for i in product)
result

'Laptop,10,699'

In [9]:
type(result)

str

In [10]:
x = 'Sorafenib,Sorafenib,Erlotinib,Erlotinib,Sorafenib'
x

'Sorafenib,Sorafenib,Erlotinib,Erlotinib,Sorafenib'

In [11]:
a=','.join(x)
a

'S,o,r,a,f,e,n,i,b,,,S,o,r,a,f,e,n,i,b,,,E,r,l,o,t,i,n,i,b,,,E,r,l,o,t,i,n,i,b,,,S,o,r,a,f,e,n,i,b'

In [17]:
li=[4,4,3,3,2,2]
a=[]
l1=[a.append(i) for i in li if i not in a]

In [18]:
a

[4, 3, 2]

In [1]:
Date='06/02/1996'
Date

'06/02/1996'

In [2]:
type(Date)

str

In [3]:
Date.split('/')

['06', '02', '1996']

In [5]:
dd=Date.split('/')[0]
dd

'06'

In [6]:
mm=Date.split('/')[1]
mm

'02'

In [7]:
yyyy=Date.split('/')[2]
yyyy

'1996'

In [1]:
l=[1,3,4,6,4,7,2,8,68,45,67,98,34,56,76,88]
l

[1, 3, 4, 6, 4, 7, 2, 8, 68, 45, 67, 98, 34, 56, 76, 88]

In [4]:
l[-1:-3:-1]

[88, 76]